In [215]:
import pandas as pd

In [216]:
calls = pd.read_csv(r"C:\cases\database\calls.csv")
internet = pd.read_csv(r"C:\cases\database\internet.csv")
tariffs = pd.read_csv(r"C:\cases\database\tariffs.csv")
users = pd.read_csv(r"C:\cases\database\users.csv")
messages = pd.read_csv(r"C:\cases\database\messages.csv")

USERS

In [217]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     500 non-null    int64
 1   age         500 non-null    int64
 2   churn_date  38 non-null     object
 3   city        500 non-null    object
 4   first_name  500 non-null    object
 5   last_name   500 non-null    object
 6   reg_date    500 non-null    object
 7   tariff      500 non-null    object
dtypes: int64(2), object(6)
memory usage: 31.4+ KB

In [218]:
users['churn_date'] = pd.to_datetime(users['churn_date'], format='%Y-%m-%d', errors='coerce')
users['reg_date'] = pd.to_datetime(users['reg_date'], format='%Y-%m-%d', errors='coerce')

In [219]:
users_null = users.isnull().sum().sum()

if users_null == 0:
    print("There are no missing values ðŸ’…")
else:
    print("Total missing values:", users_null)

Total missing values: 462

In [220]:
users.isnull().sum()

user_id         0
age             0
churn_date    462
city            0
first_name      0
last_name       0
reg_date        0
tariff          0
dtype: int64

Why data is missing? Because the tariff is still active.

In [221]:
duplicates = users[users.duplicated()]
num_duplicates = duplicates.shape[0]
print(num_duplicates)

0

In [222]:
users.describe()

,user_id,age,churn_date,reg_date
count,500.000000,500.00000,38,500
mean,1249.500000,46.58800,2018-11-13 00:37:53.684210432,2018-06-30 18:57:35.999999744
min,1000.000000,18.00000,2018-08-17 00:00:00,2018-01-01 00:00:00
25%,1124.750000,32.00000,2018-10-14 00:00:00,2018-04-07 12:00:00
50%,1249.500000,46.00000,2018-11-24 00:00:00,2018-07-02 12:00:00
75%,1374.250000,62.00000,2018-12-15 12:00:00,2018-09-29 00:00:00
max,1499.000000,75.00000,2018-12-30 00:00:00,2018-12-31 00:00:00
std,144.481833,16.66763,NaN,NaN

INTERNET

In [223]:
internet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149396 entries, 0 to 149395
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Unnamed: 0    149396 non-null  int64
 1   id            149396 non-null  object
 2   mb_used       149396 non-null  float64
 3   session_date  149396 non-null  object
 4   user_id       149396 non-null  int64
dtypes: float64(1), int64(2), object(2)
memory usage: 5.7+ MB

In [224]:
internet['session_date'] = pd.to_datetime(internet['session_date'], format='%Y-%m-%d', errors='coerce')

In [225]:
users_null = internet.isnull().sum().sum()

if users_null == 0:
    print("There are no missing values ðŸ’…")
else:
    print("Total missing values:", users_null)

There are no missing values ðŸ’…

In [226]:
duplicates = internet[internet.duplicated()]
num_duplicates = duplicates.shape[0]
print(num_duplicates)

0

In [227]:
columns_to_drop = ['Unnamed: 0']
internet.drop(columns=columns_to_drop, inplace=True)

In [228]:
internet['id'].head()

0    1000_0
1    1000_1
2    1000_2
3    1000_3
4    1000_4
Name: id, dtype: object

In [229]:
internet.describe()

             mb_used                   session_date        user_id
count  149396.000000                         149396  149396.000000
mean      370.192426  2018-09-02 12:55:35.221826560    1252.099842
min         0.000000            2018-01-01 00:00:00    1000.000000
25%       138.187500            2018-07-05 00:00:00    1130.000000
50%       348.015000            2018-09-17 00:00:00    1251.000000
75%       559.552500            2018-11-14 00:00:00    1380.000000
max      1724.830000            2018-12-31 00:00:00    1499.000000
std       278.300951                            NaN     144.050823

In [230]:
messages.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 123036 entries, 0 to 123035
Data columns (total 3 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            123036 non-null  object
 1   message_date  123036 non-null  object
 2   user_id       123036 non-null  int64
dtypes: int64(1), object(2)
memory usage: 2.8+ MB

In [231]:
messages['message_date'] = pd.to_datetime(messages['message_date'], format='%Y-%m-%d', errors='coerce')

In [232]:
messages_null = messages.isnull().sum().sum()

if users_null == 0:
    print("There are no missing values ðŸ’…")
else:
    print("Total missing values:", users_null)

There are no missing values ðŸ’…

In [233]:
duplicates = messages[messages.duplicated()]
num_duplicates = duplicates.shape[0]
print(num_duplicates)

0

In [234]:
messages.describe()

                        message_date        user_id
count                         123036  123036.000000
mean   2018-09-04 15:28:42.227640576    1256.989410
min              2018-01-02 00:00:00    1000.000000
25%              2018-07-09 00:00:00    1134.000000
50%              2018-09-20 00:00:00    1271.000000
75%              2018-11-14 00:00:00    1381.000000
max              2018-12-31 00:00:00    1499.000000
std                              NaN     143.523967

In [235]:
calls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 202607 entries, 0 to 202606
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   id         202607 non-null  object
 1   call_date  202607 non-null  object
 2   duration   202607 non-null  float64
 3   user_id    202607 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 6.2+ MB

In [236]:
calls['call_date'] = pd.to_datetime(calls['call_date'], format='%Y-%m-%d', errors='coerce')

In [237]:
calls_null = calls.isnull().sum().sum()

if users_null == 0:
    print("There are no missing values ðŸ’…")
else:
    print("Total missing values:", users_null)

There are no missing values ðŸ’…

In [238]:
duplicates = calls[calls.duplicated()]
num_duplicates = duplicates.shape[0]
print(num_duplicates)

0

In [239]:
calls.describe()

                           call_date       duration        user_id
count                         202607  202607.000000  202607.000000
mean   2018-09-02 20:01:37.583992832       6.755887    1253.940619
min              2018-01-01 00:00:00       0.000000    1000.000000
25%              2018-07-05 00:00:00       1.300000    1126.000000
50%              2018-09-17 00:00:00       6.000000    1260.000000
75%              2018-11-14 00:00:00      10.700000    1379.000000
max              2018-12-31 00:00:00      38.000000    1499.000000
std                              NaN       5.843365     144.722751

    Calls by month

In [240]:
calls['calls_month'] = pd.DatetimeIndex(calls['call_date']).month
month_calls = calls.groupby('calls_month')['duration'].sum().reset_index(name='total_duration')
month_calls

    calls_month  total_duration
0             1        10206.44
1             2        23145.58
2             3        45433.85
3             4        62530.92
4             5        83770.77
5             6        99249.71
6             7       124373.23
7             8       145071.63
8             9       163723.16
9            10       183068.38
10           11       198206.23
11           12       230010.14

    messages by month

In [241]:
messages['message_month'] = pd.DatetimeIndex(messages['message_date']).month
month_messages = messages.groupby('message_month').size().reset_index(name='message_count')
month_messages

    message_month  message_count
0               1            924
1               2           1924
2               3           3648
3               4           5179
4               5           7298
5               6           8983
6               7          11320
7               8          13088
8               9          14759
9              10          17114
10             11          18244
11             12          20555

    internet by month

In [242]:
internet['session_month'] = pd.DatetimeIndex(internet['session_date']).month
inet_used = internet.groupby('session_month')['mb_used'].sum().reset_index(name='total_mb')
inet_used

    session_month    total_mb
0               1   407732.53
1               2   955251.65
2               3  1811835.61
3               4  2433311.62
4               5  3525862.24
5               6  4180017.17
6               7  5029478.75
7               8  5998157.07
8               9  6447422.36
9              10  7392170.62
10             11  7990473.01
11             12  9133555.10